In [2]:
# This .ipynb file is edited by group 4 in IST 652 class
# Members are Kishan, Babatunde, Kapil, Hemanth Chowdary and Hang
import pandas as pd
import numpy as np
import requests
import matplotlib.pyplot as plt

# Part 1

## Dataset 1

In [4]:
# Here's a dataset from UCI machine learning repository, named 'audlt'
try:
    from ucimlrepo import fetch_ucirepo 
except ImportError:
    %pip install ucimlrepo
# fetch dataset 
adult = fetch_ucirepo(id=2) 
adult=pd.concat([adult.data.features,adult.data.targets],axis=1)
adult.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [5]:
# URL:https://archive.ics.uci.edu/dataset/2/adult (need further action to download)
# Introduction: this dataset is extracted from 1994 census tract data, listing personal information like educational level, race and gender etc. Every entry is categorized by their salary level.
# Column description: see https://cseweb.ucsd.edu/classes/sp15/cse190-c/reports/sp15/048.pdf for detailed information
adult.shape
# This dataset has 48842 rows with 15 columnss

(48842, 15)

## Dataset 2

In [4]:
# Name: Monthly state sales tax collections from data.gov
# dataset url: https://catalog.data.gov/dataset/sales-tax-collections-by-state
ds2_url='https://data.transportation.gov/api/views/3qgg-2u2a/rows.csv?accessType=DOWNLOAD'
ds2_df = pd.read_csv(ds2_url)
ds2_df.dtypes

state             object
month             object
year               int64
tax type          object
value            float64
fips state         int64
numeric month      int64
note             float64
id                object
dtype: object

In [6]:
ds2_df.head()

,state,month,year,tax type,value,fips state,numeric month,note,id
0,Alabama,July,2023,motor fuel,83403043.0,1,7,NaN,1_2023_7
1,Alaska,July,2023,motor fuel,NaN,2,7,NaN,2_2023_7
2,Arizona,July,2023,motor fuel,NaN,4,7,NaN,4_2023_7
3,Arkansas,July,2023,motor fuel,48791407.0,5,7,NaN,5_2023_7
4,California,July,2023,motor fuel,754200000.0,6,7,NaN,6_2023_7

In [ ]:
# Introduction: 
# "Monthly state sales tax collections is an experimental dataset published by the U.S. Census Bureau. 
# It provides data for collections from sales taxes including motor fuel taxes. Data reported for a specific month generally represent sales taxes collected on sales made during the prior month.
# Tax collections primarily rely on unaudited data collected from existing state reports or state data sources available from and posted on the Internet. 
# Secondarily, states report the data via the Quarterly Survey of State and Local Tax Revenue. Data are updated monthly, but due to differing reporting cycles data for some states may lag."

# This dataset contains information about sales tax collections across various U.S. states.

In [5]:
ds2_df.info()
# Attributes included in this dataset are state name, month, year, tax type, and corresponding tax values. 
# Some entries have missing values denoted as NaN. 
# The dataset spans 2652 rows and 9 columns, with each row representing a specific sales tax record, providing insights into tax collections for different states and time periods.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2652 entries, 0 to 2651
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   state          2652 non-null   object
 1   month          2652 non-null   object
 2   year           2652 non-null   int64
 3   tax type       2652 non-null   object
 4   value          2151 non-null   float64
 5   fips state     2652 non-null   int64
 6   numeric month  2652 non-null   int64
 7   note           0 non-null      float64
 8   id             2652 non-null   object
dtypes: float64(2), int64(3), object(4)
memory usage: 186.6+ KB

--This dataset contains information about sales tax collections across various U.S. states. It includes details such as state name, month, year, tax type, and corresponding values. Some entries have missing values denoted as NaN. The dataset spans 2652 rows and 9 columns, with each row representing a specific sales tax record, providing insights into tax collections for different states and time periods.

# Part 2

## API 1

In [ ]:
# API url: https://jsonplaceholder.typicode.com
# Introduction: "JSONPlaceholder is a free online REST API that you can use whenever you need some fake data. 
# It can be in a README on GitHub, for a demo on CodeSandbox, in code examples on Stack Overflow,
#  ...or simply to test things locally."

In [11]:
# Sample code
base_url = "https://jsonplaceholder.typicode.com"
# This block of code request to get a list of users
users_response = requests.get(f"{base_url}/users")
users_data = users_response.json()
#This block of code request to get a list of posts by a specific user
user_id = 1
user_posts_response = requests.get(f"{base_url}/users/{user_id}/posts")
user_posts_data = user_posts_response.json()

In [13]:
# Display a list of users as a Pandas DataFrame
users_df = pd.DataFrame(users_data)
users_df.head()

,id,name,username,email,address,phone,website,company
0,1,Leanne Graham,Bret,Sincere@april.biz,"{'street': 'Kulas Light', 'suite': 'Apt. 556',...",1-770-736-8031 x56442,hildegard.org,"{'name': 'Romaguera-Crona', 'catchPhrase': 'Mu..."
1,2,Ervin Howell,Antonette,Shanna@melissa.tv,"{'street': 'Victor Plains', 'suite': 'Suite 87...",010-692-6593 x09125,anastasia.net,"{'name': 'Deckow-Crist', 'catchPhrase': 'Proac..."
2,3,Clementine Bauch,Samantha,Nathan@yesenia.net,"{'street': 'Douglas Extension', 'suite': 'Suit...",1-463-123-4447,ramiro.info,"{'name': 'Romaguera-Jacobson', 'catchPhrase': ..."
3,4,Patricia Lebsack,Karianne,Julianne.OConner@kory.org,"{'street': 'Hoeger Mall', 'suite': 'Apt. 692',...",493-170-9623 x156,kale.biz,"{'name': 'Robel-Corkery', 'catchPhrase': 'Mult..."
4,5,Chelsey Dietrich,Kamren,Lucio_Hettinger@annie.ca,"{'street': 'Skiles Walks', 'suite': 'Suite 351...",(254)954-1289,demarco.info,"{'name': 'Keebler LLC', 'catchPhrase': 'User-c..."

In [14]:
# Display posts by a specific user in a DataFrame
user_posts_df = pd.DataFrame(user_posts_data)
user_posts_df.head()

,userId,id,title,body
0,1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
1,1,2,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...
2,1,3,ea molestias quasi exercitationem repellat qui...,et iusto sed quo iure\nvoluptatem occaecati om...
3,1,4,eum et est occaecati,ullam et saepe reiciendis voluptatem adipisci\...
4,1,5,nesciunt quas odio,repudiandae veniam quaerat sunt sed\nalias aut...

## API 2